In [21]:
import pandas as pd

df = pd.read_csv('products.csv')


df.columns = ['product_id','product_name', 'last_price']
df.head()

   product_id product_name  last_price
0           2         baju      100000
1           3       celana      200000
2           4       pensil        5000

In [19]:
df = df.['product_name'].astype(str)

In [20]:
df.info()

<class 'pandas.core.series.Series'>
RangeIndex: 3 entries, 0 to 2
Series name: product_name
Non-Null Count  Dtype
--------------  -----
3 non-null      object
dtypes: object(1)
memory usage: 156.0+ bytes

In [5]:
df = pd.read_csv('sales.csv')


df.columns = ['sales_id', 'sales_at', 'shipping', 'discount', 'total_transaction']

df.head()

   sales_id             sales_at  shipping  discount  total_transaction
0         2  2023-05-17 15:16:19      3000     30000             -27000
1         3  2023-02-07 07:30:54      4000     20000             534000
2         4  2023-07-27 10:02:42         0     80000              70000
3         5  2023-05-17 14:20:34      3000     60000             743000
4         6  2023-04-04 00:04:56      1000     60000            1091000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 998 entries, 0 to 997
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sales_id           998 non-null    int64
 1   sales_at           998 non-null    object
 2   shipping           998 non-null    int64
 3   discount           998 non-null    int64
 4   total_transaction  998 non-null    int64
dtypes: int64(4), object(1)
memory usage: 39.1+ KB

In [9]:
pd.to_datetime(df.sales_at)

0     2023-05-17 15:16:19
1     2023-02-07 07:30:54
2     2023-07-27 10:02:42
3     2023-05-17 14:20:34
4     2023-04-04 00:04:56
              ...
993   2023-05-02 00:50:12
994   2023-08-04 21:48:28
995   2023-06-25 14:38:53
996   2023-07-11 19:20:23
997   2023-09-25 09:35:34
Name: sales_at, Length: 998, dtype: datetime64[ns]

In [13]:
df.to_csv('sales1.csv')

In [14]:
df = pd.read_csv('sales_item.csv')
df.head()

   1  1.1  3   50000  150000
0  3    1  3   50000  150000
1  3    2  2  100000  200000
2  3    3  1  200000  200000
3  4    1  3   50000  150000
4  5    1  4   50000  200000

In [15]:
df.columns = ['sales_id', 'product_id', 'qty', 'price', 'subtotal']

df.head()

   sales_id  product_id  qty   price  subtotal
0         3           1    3   50000    150000
1         3           2    2  100000    200000
2         3           3    1  200000    200000
3         4           1    3   50000    150000
4         5           1    4   50000    200000

In [16]:
df.to_csv('products1.csv')